[{"status":"Advance to Further Review","review1":18,"review2":16.0,"avg":17.0,"initial":null,"no":"17-006","combined":null,"title":"Trail improvements @ Roxhill Park","need":"Trail improvements at Roxhill Park - violence and danger in park, drug use, public intoxication ","idea":"Improve lighting and trim trees around trails .. Interpretive trail improvements ","latitude":47.51775,"longitude":-122.36925,"location":"Roxhill Park","type":"Walkways","dept":"Parks","benefits":"neighbors, Westwood Village, and city of Seattle ","dist":1,"neigh":"South Delridge"},{"status":"Advance to Further Review","review1":20,"review2":20.0,"avg":20.0,"initial":null,"no":"17-014","combined":null,"title":"Improve 5-way intersection @ Dallas Ave S, 12th Ave S, and Thistle St","need":"A traffic calming mechanism is much needed at a FIVE WAY intersection with no lights or stop signs at Dallas Ave S, 12th Ave S, and S Thistle St. There is a large business with over 100 employees & cars at this corner and it is a pedestrian pathway from the bus on 14th. There have been several near-miss incidents on this corner. ","idea":"Simple all-way stop signs; adding stop signs or yield signs. Perhaps even a roundabout. Adding crosswalks (with flashing lights) to multiple corners since it's an odd intersection. Adding a dedicated bike lane as well because a lot of cyclists go through here daily.","latitude":47.51939,"longitude":-122.31501,"location":"Dallas Ave S, 12th Ave S, S Thistle St","type":"Crossing Improvements","dept":"SDOT","benefits":"The neighbors who live at this intersection (some feel they are in danger of having a car come through their window), the neighbors who use Dallas Ave as a thoroughfare to enter and exit South Park's waterfront, the business owner and employees of the company that is currently expanding at this intersection. Many of us have witnessed accidents and confusion here. ","dist":1,"neigh":"South Park"},{"status":"Advance to Further Review","review1":16,"review2":16.0,"avg":16.0,"initial":null,"no":"17-019","combined":null,"title":"Busstop improvements on Barton St","need":"The \"Delridge Bus Triangle\" located at 9200 Delridge Way, is an SDOT managed property in the heart of the Westwood Highland Park Residential Urban Village. This public right of way is fraught with hiding places for intravenous drug use, drug dealing, prostitution and illegal dumping right along the heavy commuter driven Delridge Way corridor.  Delridge is unsafe to cross at this natural central location. This area has a high pedestrian inter-connectivity between pending Delridge H Rapid Ride line to the east, and the Westwood Village Transit mall at Roxbury Park to the west along Barton Street SW.","idea":"We have already created a \"Friends of the Delridge Bus Triangle\" committee, in partnership with SDOT. We held our first meeting on Jan 28th, 2017 to document the history, needs and collective vision of the space. That document can be found here: https:\/\/docs.google.com\/document\/d\/1WbNyNKrp7B3TAM4S_uBV6g2NK3bN-wELv97QLfSB4ak\/edit","latitude":47.520934,"longitude":-122.35829,"location":"9200 Delridge Way SW, cross streets are Barton STREET SW to the north, and 18th Ave SW to the east. ","type":"Other","dept":"SDOT","benefits":"Everyone living in along the South Delridge Corridor, with particular benefit to the marginalized, at-risk children that live in the densely populated area immediately east of this space. ","dist":1,"neigh":"South Delridge"},{"status":"Advance to Further Review","review1":15,"review2":18.0,"avg":16.5,"initial":null,"no":"17-031","combined":null,"title":"Crossing Improvement along SW Henderson St","need":"Improve crossings along SW Henderson St at 12th, 13th, or 17th Ave SW","idea":"A clearly marked cross walk and parking restrictions near the curb would be a start to helping to increase visibility for cars as well as pedestrians.   Extending the curbs, however, would make a huge difference.   This would allow cars on Henderson to far more easily see pedestrians who are trying to cross on their way to and from school. ","latitude":47.52284,"longitude":-122.35164,"location":"Henderson & 13th Ave SW 98106","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians and drivers alike.  The neighborhood benefits by an increase in safety and walkability.","dist":1,"neigh":"Highland Park"},{"status":"Advance to Further Review","review1":20,"review2":17.0,"avg":18.5,"initial":null,"no":"17-044","combined":null,"title":"Improved crossings on S. Cloverdale ","need":"S Cloverdale St is a busy road and 12th Ave S was identified in South Park's Open Space plan as a secondary improved walking\/bike route. We would like to increase the safety for pedestrians to cross Cloverdale at 8th, 10th, or 12th Ave S; Cars speed through a vital intersection in neighborhood. It's near a freeway entrance and it's an arterial but pedestrians must cross this particular street to access neighborhood offerings; Safer crossing on cloverdale in South park to the elementary school.","idea":"Crosswalks on S. Cloverdale at 8th Ave S, 10th Ave S. and\/or 12th Ave S. for pedestrians to cross safely with a high vis sign alerting drivers to the possibility of pedestrians; Speed bumps, crosswalks, and wheelchair accessibility.  Sidewalks and planter strips ;Light up crosswalks. ","latitude":47.52645,"longitude":-122.32023,"location":"S. Cloverdale at 10th Ave S and 12th Ave S. Skate Park, South Park Meadow Dallas and 12th Ave S, Cloverdale and 5th Ave s.","type":"Crossing Improvements","dept":"SDOT","benefits":"The entire neighborhood ","dist":1,"neigh":"South Park"},{"status":"Advance to Further Review","review1":14,"review2":18.0,"avg":16.0,"initial":null,"no":"17-068","combined":null,"title":"Crossing improvements at 35th Ave & SW Dawson St","need":"Safer ped crossing @ 35th Ave SW to Camp Long, near SW Dawson St ","idea":"A crosswalk at the intersection of 35th Ave SW and SW Dawson Street (the entrance to Camp Long), including an island in the median.","latitude":47.555598,"longitude":-122.376317,"location":"The intersection between 35th Ave SW and SW Dawson Street in West Seattle","type":"Crossing Improvements","dept":"SDOT","benefits":"Children, community members and nature-lovers who use Camp Long and live in the surrounding area.","dist":1,"neigh":"West Seattle"},{"status":"Advance to Further Review","review1":17,"review2":17.0,"avg":17.0,"initial":null,"no":"17-085","combined":null,"title":"Add sidewalks to S. Sylvan Way","need":"To make the community safer.  It's a residential area and kids take the bus and some walk to school.  There is also a sharp curve and cars drive fast.  Its really unsafe.","idea":"Add sidewalks to S. Sylvan Way","latitude":47.540606,"longitude":-122.369774,"location":"S. Sylvan Way","type":null,"dept":"SDOT","benefits":"People walking","dist":1,"neigh":"High Point"},{"status":"Advance to Further Review","review1":16,"review2":19.0,"avg":17.5,"initial":null,"no":"17-145","combined":null,"title":"Install painted crosswalk at SW Alaska St. and 38th Ave SW","need":"The intersection of SW Alaska and 38th Ave SW is a very congested intersection for both vehicles and pedestrians that would benefit both by having a marked North-South crosswalk.    Transit  On the northwest corner of the intersection there is the C Line Rapid Ride stop. With the fairly recent addition of new apartments (Link, Spruce) and the current addition of more (Whittaker) as well as the proposed upzoning of the single family housing near this intersection the amount of commuter traffic that exits at this stop is heavy today and will continue to grow over time.      Safety  During peak travel times westbound vehicle traffic on SW Alaska backs up from the SW Alaska and Fauntleroy Way SW intersection back through the SW Alaska and 38th Ave SW intersection.  Vehicles often block the intersection which creates a safety issue for pedestrians trying to cross to the south side of the street.  Vehicles trying to pass through the intersection north-south on 38th Ave SW are also blocked and cause those sides of the intersection to back up as well.  It also creates a safety issue as there is a fire station on the southeast corner of the intersection.  Additionally, students that are in the walk zone to Fairmount Park Elementary also need to cross this intersection to get to school.","idea":"Create a market north-south crosswalk on the west side of the street.  SDOT should determine whether additional measures such as overhead signs or flashing beacons are also necessary","latitude":47.56105,"longitude":-122.3801,"location":"The intersection of SW Alaska and 38th Ave SW","type":"Crossing Improvements","dept":"SDOT","benefits":"Pedestrians, Elementary school students, motoristsFire station","dist":1,"neigh":"West Seattle"},{"status":"Advance to Further Review","review1":0,"review2":19.0,"avg":9.5,"initial":null,"no":"17-146 ","combined":"With 17-145","title":"Improve crossing at Alaska Ave & 37th St","need":"It is dangerous to cross Alaska Ave at 37th.  Cars do not always see pedestrians.  Due to the proximity to the Y and other businesses in the Triangle, crossing at Fauntleroy or 35th is not as common as people crossing at 37th, and it can be risky.  ","idea":"A cross-walk with signage.  No light, just a crosswalk light up sign at most.  ","latitude":47.56106,"longitude":-122.37879,"location":"37th Ave SW and Alaska","type":"Crossing Improvements","dept":"SDOT","benefits":"The community in the Fairmount Park area along with all the apartment dwellers that park in our neighborhood due to poor planning for parking at the aparments.  ","dist":1,"neigh":"Fairmount Park"},{"status":"Advance to Further Review","review1":0,"review2":15.0,"avg":7.5,"initial":null,"no":"17-147","combined":"With 17-145","title":"Improve crossing at Alaska Ave & 37th St","need":"Pedestrian safety at intersection of SW Alaska and 37th AVE SW.  With the new Rapid Ride bus lanes on Alaska and general increase in traffic due to all of the new housing (and yet to come housing) in the Alaska Junction, crossing Alaska is very difficult.  Now that the YMCA has been remodeled, there is an increasing number of pedestrians trying to cross SW Alaska.  Already there have been multiple vehicle accidents at this intersection and we should take action before a serious accident occurs.","idea":"Cross walk with flashing lights","latitude":47.56106,"longitude":-122.37879,"location":"intersection of 37th AVE SW and SW Alaska","type":"Crossing Improvements","dept":"SDOT","benefits":"Alaska Junction and nearby neighborhood residents will be able to safely cross SW Alaska St.","dist":1,"neigh":"West Seattle"}]